blueskycoco/d5/SRC/DRIVERS/NDIS/lpc3250_NDIS_Miniport.c

#include <Ndis.h>
#include <PKFuncs.h>
#include "LPC3250_NDIS_Adapter.h"
#include "LPC3250_NDIS_Proto.h"
#include  "clkpwr_support.h"
#include "Bsp.h"
//#include "lpcddk.h"



#define IS_ALPHANUM(_x)		(  ((_x >= 'a') && (_x <= 'z')) \
							|| ((_x >= 'A') && (_x <= 'Z')) \
							|| ((_x >= '0') && (_x <= '9')) )

void LPC_PrintFrame(BYTE *pbData, DWORD dwLength)
{
	int a,b;

	DEBUGMSG(ZONE_INFO, (L"\r\nPacketLength = %d\r\n",dwLength));

	b = dwLength;
	while(b)
	{
		for(a=0; (a<16) && ((b-a) > 0);a++)
			DEBUGMSG(ZONE_INFO, (L"%.2x ",pbData[dwLength-b+a]));
		DEBUGMSG(ZONE_INFO, (L"\t"));
		for(a=0; (a<16) && ((b-a) > 0);a++)
			if(IS_ALPHANUM(pbData[dwLength-b+a]))
				DEBUGMSG(ZONE_INFO, (L"%c",pbData[dwLength-b+a]));
			else
				DEBUGMSG(ZONE_INFO, (L"."));
		DEBUGMSG(ZONE_INFO, (L"\r\n"));
		b -= a;
	}
	DEBUGMSG(ZONE_INFO, (L"\r\n"));
}

void LPC_PrintTSV(P_ETHERNET_REGS_T pEMAC)
{
	DEBUGMSG(ZONE_INFO | ZONE_ERROR, (L"pEMAC->TSV0      = 0x%.8x\t(",pEMAC->tsv0));
	if((pEMAC->tsv0 & TSV0_CRC_ERROR) != 0)
		DEBUGMSG(ZONE_INFO | ZONE_ERROR, (L"CRCError "));
	if((pEMAC->tsv0 & TSV0_LEN_CHECK_ERROR) != 0)
		DEBUGMSG(ZONE_INFO | ZONE_ERROR, (L"LengthCheck "));
	if((pEMAC->tsv0 & TSV0_LEN_OUT_OF_RANGE) != 0)
		DEBUGMSG(ZONE_INFO | ZONE_ERROR, (L"OutOfRange "));
	if((pEMAC->tsv0 & TSV0_DONE) != 0)
		DEBUGMSG(ZONE_INFO | ZONE_ERROR, (L"DONE "));
	if((pEMAC->tsv0 & TSV0_MULTICAST) != 0)
		DEBUGMSG(ZONE_INFO | ZONE_ERROR, (L"MULTI "));
	if((pEMAC->tsv0 & TSV0_BROADCAST) != 0)
		DEBUGMSG(ZONE_INFO | ZONE_ERROR, (L"BROAD "));
	if((pEMAC->tsv0 & TSV0_PACKET_DEFER) != 0)
		DEBUGMSG(ZONE_INFO | ZONE_ERROR, (L"DEFERED "));
	if((pEMAC->tsv0 & TSV0_EXCESSIVE_DEFER) != 0)
		DEBUGMSG(ZONE_INFO | ZONE_ERROR, (L"EXCESS_DEFER "));
	if((pEMAC->tsv0 & TSV0_EXCESSIVE_COLLISION) != 0)
		DEBUGMSG(ZONE_INFO | ZONE_ERROR, (L"COLL "));
	if((pEMAC->tsv0 & TSV0_LATE_COLLISION) != 0)
		DEBUGMSG(ZONE_INFO | ZONE_ERROR, (L"LATE_COLL "));
	if((pEMAC->tsv0 & TSV0_GIANT) != 0)
		DEBUGMSG(ZONE_INFO | ZONE_ERROR, (L"GIANT "));
	if((pEMAC->tsv0 & TSV0_UNDERRUN) != 0)
		DEBUGMSG(ZONE_INFO | ZONE_ERROR, (L"UNDER "));
	
	DEBUGMSG(ZONE_INFO | ZONE_ERROR, (L"%d bytes ",(pEMAC->TSV0 & TSV0_TOTAL_BYTES_MASK) >> TSV0_TOTAL_BYTES_OFFSET));
	
	if((pEMAC->tsv0 & TSV0_VLAN) != 0)
		DEBUGMSG(ZONE_INFO | ZONE_ERROR, (L"VLAN "));
	if((pEMAC->tsv0 & TSV0_BACKPRESSURE) != 0)
		DEBUGMSG(ZONE_INFO | ZONE_ERROR, (L"BACK "));
	if((pEMAC->tsv0 & TSV0_PAUSE) != 0)
		DEBUGMSG(ZONE_INFO | ZONE_ERROR, (L"PAUSE "));
	if((pEMAC->tsv0 & TSV0_CONTROLFRAME) != 0)
		DEBUGMSG(ZONE_INFO | ZONE_ERROR, (L"CTRL "));

	DEBUGMSG(ZONE_INFO | ZONE_ERROR, (L")\r\n"));

	DEBUGMSG(ZONE_INFO | ZONE_ERROR, (L"pEMAC->TSV1      = 0x%.8x\t(%d bytes ; %d coll)\r\n",
					pEMAC->TSV1,
					(pEMAC->TSV1 & TSV1_TXBYTECOUNT_MASK) >> TSV1_TXBYTECOUNT_OFFSET,
					(pEMAC->TSV1 & TSV1_TXCOLCOUNT_MASK) >> TSV1_TXCOLCOUNT_OFFSET));
}
void LPC_PrintRSV(P_ETHERNET_REGS_T pEMAC)
{
	DEBUGMSG(ZONE_INFO | ZONE_ERROR, (L"pEMAC->RSV       = 0x%.8x\t(",pEMAC->RSV));
	DEBUGMSG(ZONE_INFO | ZONE_ERROR, (L"%d bytes ",(pEMAC->RSV & RSV_RCV_BYTES_CNT_MASK) >> RSV_RCV_BYTES_CNT_OFFSET));
	if((pEMAC->rsv & RSV_PCKT_PRV_IGNORED) != 0)
		DEBUGMSG(ZONE_INFO | ZONE_ERROR, (L"PCKT_PREV_IGN "));
	if((pEMAC->rsv & RSV_RXDV_EVT_PRV_SEEN) != 0)
		DEBUGMSG(ZONE_INFO | ZONE_ERROR, (L"RSV_RXDV_EVT_PRV_SEEN "));
	if((pEMAC->rsv & RSV_CARRIER_EVT_PRV_SEEN) != 0)
		DEBUGMSG(ZONE_INFO | ZONE_ERROR, (L"RSV_CARRIER_EVT_PRV_SEEN "));
	if((pEMAC->rsv & RSV_RECEIVED_CODE_VIOLATION) != 0)
		DEBUGMSG(ZONE_INFO | ZONE_ERROR, (L"RX_CODE_VIOL "));
	if((pEMAC->rsv & RSV_CRC_ERROR) != 0)
		DEBUGMSG(ZONE_INFO | ZONE_ERROR, (L"CRC_ERR "));
	if((pEMAC->rsv & RSV_LEN_CHECK_ERROR) != 0)
		DEBUGMSG(ZONE_INFO | ZONE_ERROR, (L"LEN_CHK_ERR "));
	if((pEMAC->rsv & RSV_LEN_OUT_OF_RANGE) != 0)
		DEBUGMSG(ZONE_INFO | ZONE_ERROR, (L"LEN_OOR "));
	if((pEMAC->rsv & RSV_RECEIVE_OK) != 0)
		DEBUGMSG(ZONE_INFO | ZONE_ERROR, (L"RECEIVE_OK "));
	if((pEMAC->rsv & RSV_MULTICAST) != 0)
		DEBUGMSG(ZONE_INFO | ZONE_ERROR, (L"MULTI "));
	if((pEMAC->rsv & RSV_BROADCAST) != 0)
		DEBUGMSG(ZONE_INFO | ZONE_ERROR, (L"BROAD "));
	if((pEMAC->rsv & RSV_DRIBBLE_NIBBLE) != 0)
		DEBUGMSG(ZONE_INFO | ZONE_ERROR, (L"DRBL_NIBL "));
	if((pEMAC->rsv & RSV_CTRL_FRAME) != 0)
		DEBUGMSG(ZONE_INFO | ZONE_ERROR, (L"CTRL_FRM "));
	if((pEMAC->rsv & RSV_PAUSE) != 0)
		DEBUGMSG(ZONE_INFO | ZONE_ERROR, (L"PAUSE "));
	if((pEMAC->rsv & RSV_UNSUPPORTED_OP) != 0)
		DEBUGMSG(ZONE_INFO | ZONE_ERROR, (L"UNSUPPORTED "));
	if((pEMAC->rsv & RSV_VLAN) != 0)
		DEBUGMSG(ZONE_INFO | ZONE_ERROR, (L"VLAN "));
	DEBUGMSG(ZONE_INFO | ZONE_ERROR, (L")\r\n"));
}


/*
Function Name : LAN91CNDIS-MiniportHalt       
Description   :
MiniportHalt is a required function that de-allocates resources 
when the network adapter is removed and halts the network adapter
Parameters    :    
NDIS_HANDLE AdapterContext - Specifies the handle to a 
miniport-allocated context area 
Return Value  :
VOID
*/
VOID LPC3xxx_NDIS_MiniportHalt(NDIS_HANDLE AdapterContext)
{
	PMINIPORT_ADAPTER   pAdapter = (MINIPORT_ADAPTER *) AdapterContext;
	BackOut(pAdapter);
	return;
}


/*
Function Name : LPC3250_NDIS_MiniportQueryInformation
Description   : This function is a required function 
that returns information about the capabilities 
and status of the driver and/or its network adapter.
Parameters    :
NDIS_HANDLE AdapterContext - Handle to the adapter structure
NDIS_OID    Oid - OID code designation the query operation that the driver should carr out
PVOID       InformationBuffer - pointer to the buffer in which the driver return the value
ULONG       InformationBufferLength - lenght of the buffer
PULONG      BytesWritten - number of bytes the driver is returning
PULONG      BytesNeeded - additional bytes, if needed, to satisfy the query.
Return Value  :
NDIS_STATUS Status
*/
NDIS_STATUS LPC3xxx_NDIS_MiniportQueryInformation(	NDIS_HANDLE AdapterContext,
													NDIS_OID    Oid,
													PVOID       InformationBuffer,
													ULONG       InformationBufferLength,
													PULONG      BytesWritten,
													PULONG      BytesNeeded)
{
	MINIPORT_ADAPTER	*Adapter	= (MINIPORT_ADAPTER *) AdapterContext;
	NDIS_STATUS			Status		= NDIS_STATUS_SUCCESS;
	NDIS_OID			ReturnData;
    void				*Source		= &ReturnData;
    UINT				BytesToMove	= sizeof(NDIS_OID);
	
    
	DEBUGMSG(ZONE_INFO, (TEXT("LPC3250 NDIS ==> MiniportQuery Information OID=%x, "), Oid));
	switch(Oid)
    {
		case OID_GEN_SUPPORTED_LIST:
			DEBUGMSG(ZONE_INFO, (TEXT("OID_GEN_SUPPORTED_LIST\r\n")));
			Source      = (void *) &GlobalObjects;
			BytesToMove = sizeof(GlobalObjects);
			break;

