blueskycoco/d5/SRC/DRIVERS/NDIS/lpc3250_NDIS_Miniport.c
		case OID_GEN_MEDIA_SUPPORTED:
			DEBUGMSG(ZONE_INFO, (TEXT("OID_GEN_MEDIA_SUPPORTED\r\n")));
			ReturnData = NdisMedium802_3;
			break;

		case OID_GEN_MEDIA_IN_USE:
			DEBUGMSG(ZONE_INFO, (TEXT("OID_GEN_MEDIA_IN_USE\r\n")));
			ReturnData = NdisMedium802_3;
			break;

		case OID_GEN_MAXIMUM_LOOKAHEAD:
			DEBUGMSG(ZONE_INFO, (TEXT("OID_GEN_MAXIMUM_LOOKAHEAD\r\n")));
			ReturnData = Adapter->dwLookAheadBufferSize;
			break;
			
		case OID_GEN_MAXIMUM_FRAME_SIZE:
			DEBUGMSG(ZONE_INFO, (TEXT("OID_GEN_MAXIMUM_FRAME_SIZE\r\n")));
			ReturnData = MAX_FRAME_SIZE;
			break;		

		case OID_GEN_LINK_SPEED:
			DEBUGMSG(ZONE_INFO, (TEXT("OID_GEN_LINK_SPEED\r\n")));
			ReturnData = Adapter->b100Mbps ? 100000 : 10000;
			break;		

		case OID_GEN_TRANSMIT_BUFFER_SPACE: 
			DEBUGMSG(ZONE_INFO, (TEXT("OID_GEN_TRANSMIT_BUFFER_SPACE\r\n")));
			ReturnData = MAX_FRAME_SIZE;
			break;

		case OID_GEN_RECEIVE_BUFFER_SPACE: 
			DEBUGMSG(ZONE_INFO, (TEXT("OID_GEN_RECEIVE_BUFFER_SPACE\r\n")));
			ReturnData = Adapter->dwRxStrides * MAX_FRAME_SIZE;		
			break;

		case OID_GEN_TRANSMIT_BLOCK_SIZE: 
			DEBUGMSG(ZONE_INFO, (TEXT("OID_GEN_TRANSMIT_BLOCK_SIZE\r\n")));
			ReturnData = MAX_FRAME_SIZE;
			break;

		case OID_GEN_RECEIVE_BLOCK_SIZE: 
			DEBUGMSG(ZONE_INFO, (TEXT("OID_GEN_RECEIVE_BLOCK_SIZE\r\n")));
			ReturnData = MAX_FRAME_SIZE;
			break;

		case OID_GEN_VENDOR_ID:
			DEBUGMSG(ZONE_INFO, (TEXT("OID_GEN_VENDOR_ID\r\n")));
			ReturnData = 0;
			NdisMoveMemory((void *) &ReturnData,(void *) &Adapter->MACAddress,	3);
			break;

		case OID_GEN_VENDOR_DESCRIPTION: 
			DEBUGMSG(ZONE_INFO, (TEXT("OID_GEN_VENDOR_DESCRIPTION\r\n")));
			Source      = (void *) DRV_VENDOR_NAME;
			BytesToMove = SIZE_DRV_VENDOR_NAME;
			break;

		case OID_GEN_CURRENT_LOOKAHEAD:  
			DEBUGMSG(ZONE_INFO, (TEXT("OID_GEN_CURRENT_LOOKAHEAD\r\n")));
			ReturnData = MAX_FRAME_SIZE;
			break;

		case OID_GEN_DRIVER_VERSION:  
			DEBUGMSG(ZONE_INFO, (TEXT("OID_GEN_DRIVER_VERSION\r\n")));
			BytesToMove = 2;
			ReturnData  = DRIVER_NDIS_VERSION;
			break;

		case OID_GEN_MAXIMUM_TOTAL_SIZE:  
			DEBUGMSG(ZONE_INFO, (TEXT("OID_GEN_MAXIMUM_TOTAL_SIZE\r\n")));
			ReturnData = MAX_FRAME_SIZE;
			break;

		case OID_GEN_MAC_OPTIONS: 
			DEBUGMSG(ZONE_INFO, (TEXT("OID_GEN_MAC_OPTIONS\r\n")));
			ReturnData =	NDIS_MAC_OPTION_COPY_LOOKAHEAD_DATA |
							NDIS_MAC_OPTION_RECEIVE_SERIALIZED  |
							NDIS_MAC_OPTION_TRANSFERS_NOT_PEND  |
							NDIS_MAC_OPTION_NO_LOOPBACK;
			break;

		case OID_802_3_PERMANENT_ADDRESS:
			DEBUGMSG(ZONE_INIT, (TEXT("OID_802_3_PERMANENT_ADDRESS\r\n")));
			Source      = (void *) &Adapter->MACAddress;
			BytesToMove = MAC_ADDRESS_SIZE;
			break;

		case OID_802_3_CURRENT_ADDRESS: 
			DEBUGMSG(ZONE_INFO, (TEXT("OID_802_3_CURRENT_ADDRESS\r\n")));
			Source      = (void *) &Adapter->MACAddress;
			BytesToMove = MAC_ADDRESS_SIZE;
			break;

		case OID_802_3_MULTICAST_LIST:
			DEBUGMSG(ZONE_INFO, (TEXT("OID_802_3_MULTICAST_LIST\r\n")));
			BytesToMove = Adapter->tMulticastTable.MulticastTableEntryCount 
				* ETH_LENGTH_OF_ADDRESS;
			Source = (void *) Adapter->tMulticastTable.MulticastTableEntry;
			break;

		case OID_802_3_MAXIMUM_LIST_SIZE: 
			DEBUGMSG(ZONE_INFO, (TEXT("OID_802_3_MAXIMUM_LIST_SIZE\r\n")));
			ReturnData = MAX_MULTICAST_ADDRESS;
			break;

/*
		case OID_802_3_RCV_ERROR_ALIGNMENT:
			DEBUGMSG(ZONE_INFO, (TEXT("OID_802_3_RCV_ERROR_ALIGNMENT\r\n")));
			ReturnData = Adapter->Stat_AlignError;		
			break;

		case OID_802_3_XMIT_ONE_COLLISION:
			DEBUGMSG(ZONE_INFO, (TEXT("OID_802_3_XMIT_ONE_COLLISION\r\n")));
			ReturnData = Adapter->Stat_SingleColl;
			break;		
	        
		case OID_802_3_XMIT_MORE_COLLISIONS:
			DEBUGMSG(ZONE_INFO, (TEXT("OID_802_3_XMIT_MORE_COLLISIONS\r\n")));
			ReturnData = Adapter->Stat_MultiColl;
			break;
*/
		case OID_GEN_MEDIA_CONNECT_STATUS:
			DEBUGMSG(ZONE_INFO, (TEXT("OID_GEN_MEDIA_CONNECT_STATUS\r\n")));
			LPC3xxx_NDIS_MiniportUpdateLink(Adapter);
			if(!Adapter->bMediaConnected)
			{
				ReturnData = NdisMediaStateDisconnected;
				DEBUGMSG(ZONE_INFO, (L"NdisMediaStateDisconnected\r\n"));
			}
			else
			{
				ReturnData = NdisMediaStateConnected;
				DEBUGMSG(ZONE_INFO, (L"NdisMediaStateConnected\r\n"));
			}
			break;

		case OID_GEN_VENDOR_DRIVER_VERSION:
			DEBUGMSG(ZONE_INFO, (TEXT("OID_GEN_VENDOR_DRIVER_VERSION\r\n")));
			ReturnData = ((DRIVER_NDIS_MINOR_VERSION >> 16 ) | 
				DRIVER_NDIS_MAJOR_VERSION);
			break;

		case OID_GEN_MAXIMUM_SEND_PACKETS:
			DEBUGMSG(ZONE_INFO, (TEXT("OID_GEN_MAXIMUM_SEND_PACKETS\r\n")));
			ReturnData = 1;
			break;
/*
		case OID_GEN_XMIT_OK:
			ReturnData = Adapter->Stat_TxOK;
			break;		
			
		case OID_GEN_RCV_OK:
			ReturnData = Adapter->Stat_RxOK;
			break;
			
		case OID_GEN_XMIT_ERROR:
			ReturnData = Adapter->Stat_TxError;
			break;
			
		case OID_GEN_RCV_ERROR:
			ReturnData = Adapter->Stat_RxError;
			break;
			
		case OID_GEN_RCV_NO_BUFFER:
			ReturnData = Adapter->Stat_RxOvrn;
			break;
*/
		case OID_GEN_HARDWARE_STATUS:
			if (Adapter->eState == NORMAL_STATE)
				ReturnData = NdisHardwareStatusReady;
			else
			{
				if(Adapter->eState == INITIALIZING_STATE)
					ReturnData = NdisHardwareStatusNotReady;
				if(Adapter->eState == RESET_STATE)
					ReturnData = NdisHardwareStatusReset;
			}
			break;

		default:
			DEBUGMSG(ZONE_INFO, (TEXT("Unknown or Unsupported OID Statistics Query\r\n")));
			BytesToMove = 0;
			Status      = NDIS_STATUS_NOT_SUPPORTED;
			break;
	}
	
	
	if(BytesToMove)
    {
        Status = CopyInfo(	InformationBuffer,
							Source,
							InformationBufferLength,
							BytesToMove,
							BytesWritten,
							BytesNeeded);
    }
	
	
	DEBUGMSG(ZONE_INFO, (TEXT("LPC3250 NDIS <== MiniportQuery Information OID\r\n")));
	return Status;
}

VOID	LPC3xxx_NDIS_MiniportUpdateLink(PMINIPORT_ADAPTER	pAdapter)
{/*
	int i;

	DEBUGMSG(ZONE_INFO, (L"LPC3xxx_NDIS_MiniportUpdateLink: Checking Link:\r\n"));
	//	Check the link status.
	for (i = 0; i < 0x10000; i++)
	{
		if(PHY_CheckLinkOK(pAdapter->pEMACRegs))
		{
			//	Link is on.
			break;
		}
	}

