blueskycoco/d5/SRC/DRIVERS/NDIS/lpc3250_NDIS_Miniport.c
	if(i == 0x10000)
	{
		DEBUGMSG(ZONE_INFO | ZONE_ERROR, (L"LPC3xxx_NDIS_MiniportUpdateLink: Link Establishment Timed out\r\n"));
		pAdapter->bMediaConnected = FALSE;
	}
	else
	{
		pAdapter->bMediaConnected = TRUE;
	}

	DEBUGMSG(ZONE_INFO, (L"LINK OK\r\n"));*/
	pAdapter->bMediaConnected = PHY_CheckLinkOK(pAdapter->pEMACRegs);
}


NDIS_STATUS     LPC3xxx_NDIS_MiniportSend(NDIS_HANDLE  AdapterContext,
										  PNDIS_PACKET pNDISPacket,
										  UINT         Flags)
{
	PMINIPORT_ADAPTER	pAdapter = (PMINIPORT_ADAPTER) AdapterContext;
	UINT				PacketLength;
	DWORD				dwTimeOut = 10;	//	We loop 10 times maximum before exiting
	BOOL				bSent = FALSE;
	LPCPS_ETH_TX_STATUS pPacketStatus;
	LPCPS_ETH_DESC		pPacketDesc;
	DWORD				dwCurrentTxSlot;

	DEBUGMSG(ZONE_TX, (TEXT("++LPC3xxx_NDIS_MiniportSend\r\n")));
	
	//Make sure that the packet size is in legal limits.
	NdisQueryPacket(pNDISPacket,NULL,NULL,NULL,(PUINT) &PacketLength);

	if ((PacketLength > MAX_FRAME_SIZE) || (PacketLength < MIN_FRAME_SIZE))
	{
		DEBUGMSG(ZONE_TX, (TEXT("LPC3250 NDIS: Invalid Packet Size\r\n")));
		DEBUGMSG(ZONE_TX, (TEXT("LPC3250 NDIS <== Miniport Send\r\n")));
		return (NDIS_STATUS_FAILURE);
	}

	//	We check if the EMAC is ready to send (aka we have a free descriptor)
	if(!EMAC_FrameTxRdy(pAdapter))	//	If we do not have enough resources, we signal it to the NDIS layer
	{
		DEBUGMSG(ZONE_TX, (TEXT("--LPC3xxx_NDIS_MiniportSend (Not enough Resources)\r\n")));
		return NDIS_STATUS_RESOURCES;
	}

	dwCurrentTxSlot = EMAC_TxSlotGetCurrentProducer(pAdapter);

	//	We fill up the status
	pPacketDesc = EMAC_TxDescGetCurrent(pAdapter);

	DEBUGMSG(ZONE_TX, (L"pPacketDesc                = 0x%.8x\r\n",pPacketDesc));
	DEBUGMSG(ZONE_TX, (L"pPacketDesc->PacketAddress = 0x%.8x\r\n",pPacketDesc->PacketAddress));
	DEBUGMSG(ZONE_TX, (L"pPacketDesc->Control       = 0x%.8x\r\n",pPacketDesc->Control));

	pPacketDesc->Control = ((PacketLength-1) & ETH_TX_DESC_SIZE) |
							ETH_TX_DESC_LAST |
							ETH_TX_DESC_INTERRUPT;

	pPacketStatus = EMAC_TxStatusGetCurrent(pAdapter);
	DEBUGMSG(ZONE_TX, (L"pPacketStatus              = 0x%.8x\r\n",pPacketStatus));
	DEBUGMSG(ZONE_TX, (L"pPacketStatus->StatusInfo  = 0x%.8x\r\n",pPacketStatus->StatusInfo));

	//	We clear all status to make sure
	pPacketStatus->StatusInfo = 0;

	//	We copy the frame into the buffer
	EMAC_TxBuffCopyCurrent(pAdapter, pNDISPacket);

	//	We produce and let the interrupt handle deals with it
	//		First we fill the structure to be used in the IT
	pAdapter->pTXPackets[dwCurrentTxSlot].pNDISPacket = pNDISPacket;
	pAdapter->pTXPackets[dwCurrentTxSlot].dwPacketSize = PacketLength;
	//		Then we produce it
	EMAC_TxDescProduce(pAdapter);

	DEBUGMSG(ZONE_TX, (TEXT("--LPC3xxx_NDIS_MiniportSend\r\n")));

	return (NDIS_STATUS_PENDING);	//	If we do not check and wait for completion here : RGUNS TODO
}

BOOL HardReset(PMINIPORT_ADAPTER pAdapter)
{
	BOOL rc = FALSE;
	DEBUGMSG(ZONE_INFO, (TEXT("++HardReset\r\n")));

	pAdapter->eState = RESET_STATE;

	//	Reseting PHY
	if(!PHY_SWReset(pAdapter->pEMACRegs))
	{
		DEBUGMSG(ZONE_INFO, (L"HardReset: PHY Reset failed.\r\n"));
		DEBUGMSG(ZONE_INFO, (TEXT("--HardReset\r\n")));
		return FALSE;
	}

	rc = AdapterReset(pAdapter);

	DEBUGMSG(ZONE_INFO, (TEXT("--HardReset(rc=%s)\r\n"),rc ? L"TRUE" : L"FALSE"));

	return rc;
}
BOOL AdapterReset(PMINIPORT_ADAPTER pAdapter)
{
	DWORD	i;
	DWORD	dwHClk,bytesret;
	DWORD	dwTempReg;

	DEBUGMSG(ZONE_INFO, (TEXT("++AdapterReset\r\n")));

	pAdapter->eState = RESET_STATE;

	//	Now the controller is on, we can access the registers of the MAC

	pAdapter->pEMACRegs->mcfg = MCFG_HCLK_DIV_28;	//	Only 1 PHY, no Suppressed Preamble, Host Clock divided by 28

	//  Reset all EMAC internal modules
	pAdapter->pEMACRegs->mac1 = MAC1_RESET_TX |
								MAC1_RESET_MCS_TX |
								MAC1_RESET_RX |
								MAC1_RESET_MCS_RX |
								MAC1_SIMULATION_RESET |
								MAC1_SOFT_RESET;

	pAdapter->pEMACRegs->mac1 = 0;

	pAdapter->pEMACRegs->command =	COMMAND_RXRESET |
									COMMAND_TXRESET	|
									COMMAND_REGRESET;

	//	A short delay after reset
	Sleep(100);

	pAdapter->pEMACRegs->command = 0;

	DEBUGMSG(ZONE_INFO, (L"AdapterReset: Initializing MAC.\r\n"));

	//	Initialize MAC control registers
	pAdapter->pEMACRegs->mac1 = MAC1_PASS_ALL_RCV;
	pAdapter->pEMACRegs->mac2 = MAC2_CRC_EN | MAC2_PAD_CRC_EN;
	pAdapter->pEMACRegs->maxf = MAX_FRAME_SIZE & MAXF_MAXIMUM_FRAME_LEN;
	pAdapter->pEMACRegs->clrt = CLRT_DEF;
	pAdapter->pEMACRegs->ipgr = IPGR_DEF;

	//	Select RMII or MII interface
		//	Enable Reduced MII interface
	pAdapter->pEMACRegs->command =	COMMAND_RMII |
									COMMAND_PASSRUNTFRAME;

	DEBUGMSG(ZONE_INIT, (L"AdapterReset: PHY reset\r\n"));

	PHY_SetInterface(pAdapter->pEMACRegs, pAdapter->bRMII);

	if(!PHY_CheckCompatibility(pAdapter->pEMACRegs))
	{
		DEBUGMSG(ZONE_INFO, (L"NDIS Miniport: PHY is not compatible with the current BSP.\r\n"));
		return FALSE;
	}

	//	Set the Ethernet MAC Address registers
	pAdapter->pEMACRegs->sa[0] = pAdapter->MACAddress[1] | (pAdapter->MACAddress[0] << 8);
	pAdapter->pEMACRegs->sa[1] = pAdapter->MACAddress[3] | (pAdapter->MACAddress[2] << 8);
	pAdapter->pEMACRegs->sa[2] = pAdapter->MACAddress[5] | (pAdapter->MACAddress[4] << 8);

	//	Initialize Tx and Rx DMA Descriptors
	DEBUGMSG(ZONE_INIT, (L"AdapterReset: Initializing Descriptor engine\r\n"));
	EMAC_InitEngine(pAdapter);

	pAdapter->dwLastConsumed = 0;	//	Setting the LastConsumed to the current Consumed => none consumed just yet

	DEBUGMSG(ZONE_INIT, (L"AdapterReset: Checking Link: "));
	LPC3xxx_NDIS_MiniportUpdateLink(pAdapter);
	
	if(pAdapter->bMediaConnected)
	{
		DEBUGMSG(ZONE_INIT, (L"LINK Established\r\n"));
	}
	else
	{
		DEBUGMSG(ZONE_INIT, (L"LINK Not Established\r\n"));
	}

	if(pAdapter->bAutoNeg)
	{
		if(/*pAdapter->bMediaConnected && */!PHY_InitLink(pAdapter->pEMACRegs))
		{
			pAdapter->bAutoNeg = FALSE;	//	We disable the Autoneg
		}
		else
		{
			//	Configure Full/Half Duplex mode.
			if(PHY_FullDuplex(pAdapter->pEMACRegs))
			{
				//	Full duplex is enabled.
				pAdapter->bFullDuplex = TRUE;
			}
			else
			{
				//	Half duplex mode.
				pAdapter->bFullDuplex = FALSE;
			}

			//	Configure 100MBit/10MBit mode.
			if(PHY_Speed(pAdapter->pEMACRegs))
			{
				//	100MBit mode.
				pAdapter->b100Mbps = TRUE;
			}
			else
			{
				//	10MBit mode
				pAdapter->b100Mbps = FALSE;
			}
		}
	}

