blueskycoco/d5/SRC/DRIVERS/NDIS/lpc3250_NDIS_Miniport.c
	//	Setting the PHY in the right duplex mode (usually this settings is going to be ignored in AutoNeg)
	PHY_SetDuplex(pAdapter->pEMACRegs,pAdapter->bFullDuplex);

	if(pAdapter->bFullDuplex)
	{
		//	Full duplex is enabled.
		DEBUGMSG(ZONE_INIT, (L"AdapterReset: Full Duplex\r\n"));
		
		pAdapter->pEMACRegs->mac2    |= MAC2_FULL_DUPLEX;
		pAdapter->pEMACRegs->command |= COMMAND_FULLDUPLEX;
		pAdapter->pEMACRegs->ipgt     = IPGT_FULL_DUP;
	}
	else
	{
		//	Half duplex mode.
		DEBUGMSG(ZONE_INIT, (L"AdapterReset: Half Duplex\r\n"));

		pAdapter->pEMACRegs->mac2	 &= ~MAC2_FULL_DUPLEX;
		pAdapter->pEMACRegs->command &= ~COMMAND_FULLDUPLEX;
		pAdapter->pEMACRegs->ipgt	  =  IPGT_HALF_DUP;
	}

//	dwHClk = clkpwr_get_base_clock_rate(CLKPWR_PERIPH_CLK);
	if (KernelIoControl(IOCTL_LPC32XX_GETHCLK, NULL, 0, &dwHClk,
		sizeof (dwHClk), &bytesret) == FALSE)
		{
		RETAILMSG(ZONE_ERROR, 
            (TEXT("ERROR: EthNet: Error getting Einternet base clock rate.\r\n")));
		dwHClk = 104000000;
		}

	//	Configure 100MBit/10MBit mode.
	if(pAdapter->b100Mbps)
	{
		//	100MBit mode.
		DEBUGMSG(ZONE_INIT, (L"AdapterReset: 100 Mbps\r\n"));
		pAdapter->pEMACRegs->supp |= SUPP_SPEED_100MBPS;

		if(pAdapter->bRMII)	//	Are we in RMII ?
			i = dwHClk / 50000000;	//	Yes => Get Divisor for 50 MHz	(We will actually get 26 at most since we can only divide by 4)
		else
			i = dwHClk / 25000000;	//	No => Get Divisor for 25 MHz
	}
	else
	{
		//	10MBit mode
		DEBUGMSG(ZONE_INIT, (L"AdapterReset: 10 Mbps\r\n"));
		pAdapter->pEMACRegs->supp &= ~SUPP_SPEED_100MBPS;

		if(pAdapter->bRMII)	//	Are we in RMII ?
			i = dwHClk / 50000000;	//	Yes => Get Divisor for 50 MHz	(We will actually get 26 at most since we can only divide by 4)
		else
			i = (dwHClk / 25000000) * 10;	//	No => Get Divisor for 2.5 MHz (or as close as possible)
	}

	//	Now, let's get the closest range
	pAdapter->pEMACRegs->mcfg &= MCFG_CLK_SEL_MSK;
	if(i > 20)
		pAdapter->pEMACRegs->mcfg |= MCFG_HCLK_DIV_28;
	else if(i > 14)
		pAdapter->pEMACRegs->mcfg |= MCFG_HCLK_DIV_20;
	else if(i > 10)
		pAdapter->pEMACRegs->mcfg |= MCFG_HCLK_DIV_14;
	else if(i >  8)
		pAdapter->pEMACRegs->mcfg |= MCFG_HCLK_DIV_10;
	else if(i >  6)
		pAdapter->pEMACRegs->mcfg |= MCFG_HCLK_DIV_8;
	else if(i >  4)
		pAdapter->pEMACRegs->mcfg |= MCFG_HCLK_DIV_6;
	else
		pAdapter->pEMACRegs->mcfg |= MCFG_HCLK_DIV_4;

	dwTempReg = 0;

	if(pAdapter->bPerfectMatch)
	{
		dwTempReg |= RXFILTERCTRL_ACPT_PERFECT_EN;
		DEBUGMSG(1, (L"AdapterReset: Perfect Match enabled"));
	}
	if(pAdapter->bRxBroadcast)
	{
		dwTempReg |= RXFILTERCTRL_ACPT_BROADCAST_EN;
		DEBUGMSG(1, (L"AdapterReset: Broadcast enabled"));
	}
	if(pAdapter->bRxUnicastAll)
	{
		dwTempReg |= RXFILTERCTRL_ACPT_UNICAST_EN;
		DEBUGMSG(1, (L"AdapterReset: All Unicast enabled"));
	}
	if(pAdapter->bRxUnicastHash)
	{
		dwTempReg |= RXFILTERCTRL_ACPT_UNIHASH_EN;
		DEBUGMSG(1, (L"AdapterReset: Unicast Hash enabled"));
	}
	if(pAdapter->bRxMulticastHash)
	{
		dwTempReg |= RXFILTERCTRL_ACPT_MULTI_HASH_EN;
		DEBUGMSG(1, (L"AdapterReset: Multicast Hash enabled"));
	}
	if(pAdapter->bRxMulticastAll)
	{
		dwTempReg |= RXFILTERCTRL_ACPT_MULTICAST_EN;
		DEBUGMSG(1, (L"AdapterReset: All Multicast enabled"));
	}

	pAdapter->pEMACRegs->rxfliterctrl = dwTempReg;	//	Disable all filters (do not accept anything)

	if(pAdapter->bPromiscuous)
	{
		pAdapter->pEMACRegs->command |=  COMMAND_PASSRXFILTER;
		DEBUGMSG(1, (L"AdapterReset: Promiscuous enabled"));
	}
	else
	{
		pAdapter->pEMACRegs->command &= ~COMMAND_PASSRXFILTER;
		DEBUGMSG(1, (L"AdapterReset: Promiscuous disabled"));
	}

	//	Reset all interrupts
	pAdapter->pEMACRegs->intclear  = 0xFFFF;

	//	Enable EMAC interrupts.
	DEBUGMSG(ZONE_INIT, (L"AdapterReset: Enabling Interrupts\r\n"));
	pAdapter->pEMACRegs->intenable =	INT_RX_INT |
										INT_TX_INT;

	//	Enable receive and transmit mode of MAC Ethernet core
	DEBUGMSG(ZONE_INIT, (L"AdapterReset: Enabling RX & TX Paths\r\n"));
	pAdapter->pEMACRegs->command  |= (	COMMAND_RX_EN	|
										COMMAND_TX_EN	);

	pAdapter->pEMACRegs->mac1     |= MAC1_RECEIVE_EN;
/*
	if(pAdapter->bMediaConnected)
		pAdapter->eState = LINKDOWN_STATE;
	else*/
		pAdapter->eState = NORMAL_STATE;

	DEBUGMSG(ZONE_INFO, (TEXT("--AdapterReset\r\n")));

	return TRUE;
}

/*
Function Name : LPC3xxx_NDIS_MiniportReset
Description   : This function is a required function that issues a hardware reset 
to the network adapter and/or resets the driver’s software state.
Parameters    : 
PBOOLEAN    AddressingReset -Points to a variable that MiniportReset
sets to TRUE if the NDIS library should call 
MiniportSetInformation to restore addressing information 
to the current values. 
NDIS_HANDLE AdapterContext - Handle to the adapter structure

  Return Value  :
  NDIS_STATUS Status
*/
NDIS_STATUS	LPC3xxx_NDIS_MiniportReset(	PBOOLEAN    AddressingReset,
										NDIS_HANDLE AdapterContext)
{
	NDIS_STATUS			Status		= NDIS_STATUS_SUCCESS;
	PMINIPORT_ADAPTER	pAdapter	= (PMINIPORT_ADAPTER) AdapterContext;

	DEBUGMSG(ZONE_INIT, (TEXT("LPC3250 NDIS ==> Miniport Reset\r\n")));

	AdapterReset(pAdapter);

	DEBUGMSG(ZONE_INIT, (TEXT("LPC3250 NDIS <== Miniport Reset\r\n")));
	return Status;
}

/*
Function Name : LPC3xxx_NDIS_MiniportCheckforHang
Description   : This function checks for the internal state of the chip. 
Return Value  : TRUE - If the chip needs to be reset, else FALSE
*/
BOOLEAN LPC3xxx_NDIS_MiniportCheckforHang(NDIS_HANDLE AdapterContext)
{
	BOOL bPreviousLinkState;
	PMINIPORT_ADAPTER	pAdapter = (PMINIPORT_ADAPTER) AdapterContext;

	DEBUGMSG(ZONE_INFO, (L"LPC3xxx_NDIS_MiniportCheckforHang: Checking Link: "));

	bPreviousLinkState = pAdapter->bMediaConnected;	//	We save the previous state

	LPC3xxx_NDIS_MiniportUpdateLink(pAdapter);
	
	if(bPreviousLinkState != pAdapter->bMediaConnected)
	{
		if(pAdapter->bMediaConnected)
		{
			DEBUGMSG(ZONE_INFO, (L"LINK Established\r\n"));
		}
		else
		{
			DEBUGMSG(ZONE_INFO, (L"LINK Not Established\r\n"));
		}
	}
	if(pAdapter->bMediaConnected)
		pAdapter->eState = LINKDOWN_STATE;

	return	(!pAdapter->bMediaConnected) || (bPreviousLinkState != pAdapter->bMediaConnected);//	bMediaConnected is equal to TRUE if we are connected, thus we invert it
	//return FALSE;
}
